read_verilog ./Adders/opt/u_sa8.aag
techmap
#opt
aigmap
#opt
write_aiger -ascii Adders/ref/u_sa8.aag.aag
