read_blif $IN
techmap
opt
aigmap
opt
write_aiger -ascii $OUT
