read_verilog $IN
techmap
#opt
aigmap
#opt
write_aiger -ascii $OUT
